import { MockDataItemType } from "../shared/types/news.types";

export const mockNewsData: MockDataItemType[] = [
  {
    article_id: "mock1",
    title:
      "김상욱 울산시당위원장 사퇴 옳음 추구한 값 달게 받겠다.",
    image_url: "https://i-invdn-com.investing.com/news/LYNXMPEABU081_M.jpg",
    description:
      "국민의힘 내 대표적인 탄핵 찬성파로 꼽히는 김상욱 의원이 울산시당위원장직에서 자진 사퇴하며 옳음을 추구함에 값을 치루어야 한다면 달게 받을 것 이라고 했다.김 의원은 14일 국회 기자회견에서 시당위원장 사퇴 입장을 밝히며 그 이유에 대해 울산지역 6개 당협의 실질적 추대로 시당위원장이 되었으나 더 이상 추대의 실질을 유지할 수 없기에 사퇴하는 것이",
  },
  {
    article_id: "mock2",
    title: "시선 사로 잡는 수선화 [오늘의 한 컷]",
    image_url:
      "https://img1.newsis.com/2025/02/14/NISI20250214_0020700057_web.jpg?rnd=20250214122316",
    description:
      "[서울=뉴시스] 맑은 날씨를 보인 14일 오전 제주시 한림공원에 봄꽃인 수선화가 활짝 피어나 시선을 사로 잡고 있다.",
  },
  {
    article_id: "mock3",
    title:
      "내년 WBC로 달려가는 사무라이재팬, 프리미어12 출전 선수 전원 제외, ",
    image_url:
      "https://sports.chosun.com/news/html/2025/02/14/2025021401000909800141822.jpg",
    description:
      "대표 선수 28명 중 20명 첫 발탁[민창기의 일본야구.",
  },
  {
    article_id: "mock4",
    title: "권세은, 연극 '임대아파트' 선영 役 발탁 ",
    image_url:
      "https://image.edaily.co.kr/images/photo/files/NP/S/2025/02/PS25021401024.jpg",
    description:
      "배우 권세은이 연극 ‘임대아파트’에 캐스팅됐다고 소속사 와이낫미디어가 14일 밝혔다.‘임대아파트’는 임대아파트에서 지내는 청춘들이 현실과 이상의 괴리 속에서 꿈을 잃지 않고 살아가는 이야기를 그리는 작품이다. 이 작품에서 권세은은 선영 역을 맡아 무대에 오른다. 극중 배우 지망생 정호의 아련한 첫사랑 상대인 캐릭터다. 권세은은 그간 드라마 ‘청담국제고등학...",
  },
  {
    article_id: "mock5",
    title:
      "김석우 노상원 수첩, 사법적 판단 진행 중...심리 필요",
    image_url:
      "https://img1.newsis.com/2025/02/14/NISI20250214_0020700485_web.jpg",
    description:
      "[서울=뉴시스]최서진 기자 = 김석우 법무부 장관 직무대행이 14일 정치인 등 이름이 적힌 노상원 전 국군정보사령관의 수첩과 관련해 사법적 판단이 진행 중이라고 말했다.김 직무대행은 이날 오후 국회에서 열린 대정부질문에서 '노 전 사령관 수첩 관련 보도를 봤냐'는 최민희 더불어민주당 의원의 질의에 그렇다고 답했다.",
  },
  {
    article_id: "mock6",
    title:
      "'더 딴따라'의 소통 행보가 눈에 띈다. '더 딴따라' TOP5 나영주, 안영빈, 유우, 이송현, 조혜진은 최근 공식 유튜브 채널 '딴따라 25 DDDD 25'를 개설 후, '딴따라 성장일기', 'Mad(매드)' 댄스 프랙티스(Dance",
    image_url:
      "https://img.etnews.com/news/article/2025/02/14/article_14180537379892.jpg",
    description:
      "[서울=뉴시스]최서진 기자 = 김석우 법무부 장관 직무대행이 14일 정치인 등 이름이 적힌 노상원 전 국군정보사령관의 수첩과 관련해 사법적 판단이 진행 중이라고 말했다.김 직무대행은 이날 오후 국회에서 열린 대정부질문에서 '노 전 사령관 수첩 관련 보도를 봤냐'는 최민희 더불어민주당 의원의 질의에 그렇다고 답했다.",
  },
];
